# CitySet Properties

---
The CitySet type exposes the following members.
| Name| Description
---|---|---
| IsEmpty| Test to see if the set is empty.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Size| Returns the number of cities that are in the set.
Top
#### Reference
CitySet Class
Autodesk.Revit.DB Namespace